def selection_sort(arr):
    n = len(arr)  # طول القائمة
    for j in range(n - 1):  # نكرر حتى آخر عنصر ما عدا العنصر الأخير
        iMin = j  # نفترض أن العنصر الأول في القسم غير المرتب هو الأصغر
        for i in range(j + 1, n):  # نبحث عن الأصغر في باقي العناصر
            if arr[i] < arr[iMin]:  # إذا وجدنا عنصراً أصغر
                iMin = i  # نحفظ موضع العنصر الأصغر
        # بعد الانتهاء من البحث، نقوم بمبادلة العنصر الأصغر مع العنصر الحالي
        arr[j], arr[iMin] = arr[iMin], arr[j]
    return arr